refactor(IR): FIXED ISSUE 39
